/// This file contains the error codes and messages for the app
class ErrorCodes {
  static const Map<int, String> errorMessages = {
    101: 'خطأ في الإرسال، يرجى المحاولة مرة أخرى.',
    102: 'خطأ غير متوقع أثناء الإرسال.',
    201: 'خطأ في التحقق، يرجى المحاولة مرة أخرى.',
    202: 'OTP غير صالح.',
    301: 'الاتصال بالشبكة ضعيف أو غير موجود.',
    302: 'تم إلغاء الطلب، يرجى إعادة المحاولة.',
    303: 'انتهت مهلة الإرسال، يرجى المحاولة مرة أخرى.',
    304: 'انتهت مهلة الاستلام، يرجى المحاولة مرة أخرى.',
    401: 'رقم الهاتف غير صحيح.',
    501: 'المستخدم غير موجود.',
    502: 'خطأ في الطلب، يرجى المحاولة مرة أخرى.',
    601: 'انتهت صلاحية الجلسة، يرجى تسجيل الدخول مرة أخرى.',
    999: 'خطأ غير مصنف، يرجى المحاولة لاحقًا.',
  };

  static String getErrorMessage(int code) {
    return errorMessages[code] ?? 'حدث خطأ غير معروف.';
  }
}
